#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Наименование", "Проданные товары в чеках и заказах");
	ПараметрыРегистрации.Вставить("Версия", "1.0");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация", "Формирует список проданных товаров из чеков ККМ и заказов клиентов.");
	ПараметрыРегистрации.Вставить("Назначение", Новый Массив);
	ПараметрыРегистрации.Вставить("Команды", ПолучитьКомандыДополнительнойОбработки());
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьКомандыДополнительнойОбработки()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление");
	Команды.Колонки.Добавить("Идентификатор");
	Команды.Колонки.Добавить("Использование");
	Команды.Колонки.Добавить("ПоказыватьОповещение");
	Команды.Колонки.Добавить("Модификатор");
	
	ДобавитьКомандуДополнительнойОбработки(
		Команды,
		"Проданные товары в чеках и заказах",
		"ОткрытьФормуОтчета",
		"ОткрытиеФормы",
		Ложь,
		"");
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКомандуДополнительнойОбработки(
		Команды,
		Представление,
		Идентификатор,
		Использование,
		ПоказыватьОповещение = Ложь,
		Модификатор = "")
	
	НоваяКоманда = Команды.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

#КонецОбласти
